Repository: canada/perlpod
Catalog: docs/modules/CPANPLUS-0.043/*.po
Languages: fr

source: This may take a while...
fr: Cela peut prendre du temps...

source: Trying to get %1 from %2
fr: Essai de téléchargement de %1 depuis %2

source: Trying to get %1 from %2 via %3
fr: Essai de récuperer %1 depuis %2 via %3

source: UNKNOWN grades for Bundles are normal; skipped.
fr: Le grade UNKNOWN est normal pour les Bundles; on passe

source: Unable to fetch checksums file! Can not verify this distribution is safe!
fr: Impossible de récupérer le fichier de checksum! Ne peux vérifier si la distribution est saine!

source: Unable to identify caller
fr: Impossible d'identifier l'appelant

source: Unable to install %1: %2
fr: Impossible d'installer %1: %2

source: Unable to read %1
fr: Ne peut lire %1

source: Unable to uninstall %1: %2
fr: Ne peut deinstaller %1: %2

source: Unable to update source, attempting to get away with using old source file!
fr: Impossible de mettre à jour les sources, j'essaye de faire sans en utilisantl'ancien fichier source!

source: Uncompress .gz files
fr: Decompression des fichiers .gz

source: Uncompress .tar files
fr: Decompression des fichiers .tar

source: Uninstalled %1 successfully
fr: Deinstallation de %1 avec succès.

source: Uninstalling
fr: Deinstallation

source: Uninstalling %1 failed
fr: Deinstallation %1 échouée

source: Unknown
fr: Inconnu

source: Unknown command '%1'. Usage:
fr: Commande inconnue '%1'. Usage:

source: Unknown error...
fr: Erreur inconnue ...

source: Unknown file format for %1
fr: Format de fichier inconnu pour %1

source: Unknown module '%1'
fr: Module inconnu '%1'

source: Untarring %1
fr: De-tar de %1

source: Unzipping %1
fr: Unzip de %1

source: Updating source file '%1'
fr: Mise à jour du fichier source '%1'

source: Use Storable?
fr: Utiliser Storable?

source: Use passive FTP?
fr: Utiliser le FTP passif?

source: Use the md5 checksums?
fr: Utiliser les checksums md5?

source: Usenet newsgroup comp.lang.perl.modules
fr: Newsgroup Usenet comp.lang.perl.modules

source: Warning: PREREQ_PM mentions %1 more than once, last mention wins!
fr: Attention: PREREQ_PM mentionne %1 plus d'une fois, la dernère l'emporte!

source: Where can I find your '%1' executable? [%2]:
fr: Où se trouve votre executable '%1' ? [%2]:

source: Where can I find your '%1' executable?:
fr: Où se trouve votre executable '%1' ?:

source: Where shall I put it then?:
fr: Où je peux le mettre?:

source: Which CPANPLUS 'shell' do you want to use?
fr: 'shell' CPANPLUS que vous voulez utiliser?

source: Without your '%1' executable I can't function!
fr: Sans votre executable '%1' je ne peux fonctionner!

source: Would you like me to install it?
fr: Est-ce que vous voulez que je l'installe ?

source: Would you like me to install it? [Y/n]:
fr: Est-ce que vous voulez que je l'installe? [Y/n]:

source: Writing %1 failed with error: %2
fr: Ecriture de %1 échoué avec l'erreur: %2

source: Writing state information back to disk. This may take a little while.
fr: Ecriture des informations sur le disque. Cela peut prendre un peu de temps.

source: You are missing at least one of these modules: %1
fr: Il vous manque au moins l'un de ces modules: %1

source: You asked for it!
fr: Vous l'avez demandé!

source: You did not enter a valid email address, please try again!
fr: Vous n'avez pas entré une adresse mail valide, essayez à nouveau!

source: You did not pass a proper module object! %1 (%2)
fr: Vous n'avez pas passé un objet de module valide! %1 (%2)

source: You do not have %1! Please install it as soon as possible!
fr: Vous n'avez pas %1! Installez le aussi vite que possible!

source: You do not have Archive::Zip installed -- can not create .zip distribution
fr: Vous n'avez pas Archive::Zip d'installé - Ne peut créer de distribtion .zip

source: You do not have ExtUtils::Installed available!
fr: Vous n'avez pas ExtUtils::Installed d'installé!

source: You do not have File::Spec installed!
fr: Vous n'avez pas File::Spec d'installé!

source: You don't have %1! Please install it as soon as possible!
fr: Vous n'avez pas %1! Installez-le le plus vite possible!

source: You don't have %1! Please install it as soon as possible! Assuming %2 is trustworthy
fr: Vous n'avez pas %1! Installez le au plus vite! On assume que %2 est digne de confiance

source: You don't have %1, cannot continue!
fr: Vous n'avez pas %1, impossible de continuer!

source: You have *NO* hosts selected! This will probably cause problems!
fr: Vous n'avez *PAS* de hosts sélectionnés! Il va y avoir problèmes!

source: You have already sent a report for %1, skipping.\n
fr: Vous avez déjà envoyé un rapport pour %1, sauté.\n

source: You may need to do that as the 'root' user to install dependencies.
fr: Vous devez faire cela en tant que l'utilisateur 'root' pour installerles dependances.

source: You passed an object. Use CPANPLUS::Backend for OO style interaction
fr: Vous avez passé un objet. Utilisez CPANPLUS::Backend pour un style OO

source: Your %1 flags are now:
fr: Votre option %1 est maintenant:

source: Your '%1' program has been set to:
fr: Le programme '%1' a été positionné à:

source: Your 'email' is now:
fr: Votre 'email' est maintenant:

source: Your CPAN++ build and cache directory has been set to:
fr: Votre répertoire CPAN++ cache et build a été positionné à:

source: Your CPAN++ configuration info has been saved!
fr: Votre configuration CPAN++ a été sauvée!

source: Your additional libs are now:
fr: Vos librairies additionnelles sont maintenant:

source: Your command line shell has been set to:
fr: Votre shell de ligne de commande a été positionné à:

source: Your config does not specify a subshell!
fr: Votre configuration ne spécifie pas de sous-shell!

source: Your current %1 flags are:
fr: Vos options courantes pour %1 sont:

source: Your current hosts are:
fr: Votre machine courante est:

source: Your default shell %1 is not available: %2
fr: Votre shell par défaut %1 n'est pas disponible: %2

source: Your favorite command line shell?
fr: Votre shell de ligne de commande préféré?

source: Your search generated no results
fr: Votre recherche n'a généré aucun résultat.

source: [Search]
fr: [Recherche]

source: [THIS MAY BE A PROBLEM!]
fr: [CELA PEUT ETRE UN PROBLEME!]

source: available (try 'i Term::ReadLine::Perl')
fr: disponible (essayez 'i Term::ReadLine::Perl')

source: back to continents
fr: retourn aux continents

source: back to countries
fr: retour aux pays

source: back to main
fr: retour au menu principal

source: command failed: %1
fr: commande échouée: %1

source: continuing anyway.
fr: continue quand même.

source: could not call gzip: %1
fr: impossible d'appeler gzip: %1

source: could not call tar/gzip: %1
fr: impossible d'appeller tar/gzip: %1

source: could not call unzip: %1
fr: impossible d'appeler unzip: %1

source: could not cd into %1
fr: impossible de cd dans %1

source: could not fetch %1 from %2
fr: impossible de recupérer %1 depuis %2

source: could not log in to %1
fr: impossible de se logger sur %1

source: could not obtain required modules from %1
fr: impossible de recupérer les modules requis depuis %1

source: could not pipe to %1: %2\n
fr: impossible de faire un pipe sur %1: %2

source: could not remove %1: %2
fr: impossible de supprimer %1: %2

source: could not store %1!
fr: impossible de stoquer %1!

source: could not unlink %1: %2
fr: impossible de supprimer %1: %2

source: couldn't locate current dir!
fr: impossible de trouver le répertoire courant!

source: couldn't reopen STDERR: %1
fr: Ne peut reouvrir STDERR: %1

source: couldn't reopen STDOUT: %1
fr: Ne peut reouvrir STDOUT: %1

source: couldn't restore STDERR: %1
fr: Ne peut restaurer STDERR: %1

source: couldn't restore STDOUT: %1
fr: Ne peut restaurer STDOUT: %1

source: couldn't spawn process: %1
fr: Ne peut créer le processus: %1

source: create() couldn't chdir to %1! I am in %2 now
fr: create() ne peut faire un cd dans %1! Je suis dans %2 maintenant

source: curl not available
fr: curl non disponible

source: custom host
fr: machine particulière

source: disabled
fr: desactive

source: done!
fr: fait!

source: done.
fr: fait

source: enabled
fr: activé

source: error opening dir %1: %2
fr: erreur d'ouverture du repertoire %1: %2

source: extracting %1 failed!
fr: extraction de %1 echouée!

source: failed (%1)!
fr: echoué (%1)!

source: failed! (%1)
fr: echoué (%1)

source: fetching %1 failed!
fr: recupération de %1 échoué

source: fetching readme for %1 failed!
fr: récupération du readme pour %1 échoué!

source: finish
fr: fin

source: ftp creation failed: %1
fr: création ftp échoué: %1

source: hybrid, object and function interfaces available
fr: hybride, interface d'objet et de fonction disponible

source: local disk
fr: disque local

source: lynx not available
fr: lynx non disponible

source: ncftp not available
fr: ncftp non disponible

source: ncftp only works with ftp capable hosts
fr: ncftp fonctionne seulement avec les machines ftp

source: ncftpget not available
fr: ncftpget non disponible

source: ncftpget only works with ftp capable hosts
fr: ncftpget fonctionne seulement avec les machines ftp

source: no .pm files found in %1!
fr: pas de fichier .pm trouvé dans %1!

source: no interface at all (huh?)
fr: pas d'interface finalement (huh?)

source: official cpan mirror list
fr: liste officielle de mirroirs cpan

source: other (but distribution allowed without restrictions)
fr: autre (mais la distribution est autorisé sans restrictions)

source: perl and another language other than C or C++
fr: perl et un autre language comme le C ou le C++

source: plain Functions, no references used
fr: Fonctions en ligne, pas de référence utilisé

source: quit
fr: sortir

source: removing %1
fr: suppression de %1

source: some use of unblessed References or ties
fr: quelques utilisations de reférences "unblessed" ou de "tie"

source: suppressed
fr: supprimé

source: suppressed in batch mode
fr: supprimé en mode batch

source: unable to open %1: %2
fr: impossible d'ouvrir %1: %2

source: under construction but pre-alpha (not yet released)
fr: en construction mais en pre-alpha (pas encore de release)

source: unknown key: %1
fr: clef inconnue: %1

source: unknown package %1
fr: package inconnu %1

source: unlinking %1
fr: suppression de %1

source: unzip error: %1
fr: error de unzip: %1

source: view list
fr: voir la liste

source: wget not available
fr: wget non disponible

source: won't install without force!
fr: pas d'install sans la forcer
