Repository: canada/perlpod
Catalog: docs/modules/CPANPLUS-0.043/*.po
Languages: fr

source: CPAN is the world-wide archive of perl resources. It consists of about 100 sites that all replicate the same contents all around the globe. Many countries have at least one CPAN site already. The resources found on CPAN are easily accessible with CPANPLUS modules. If you want to use CPANPLUS, you have to configure it properly.
fr: CPAN est l'archive mondiale des ressources perl. Cela comprend 100 sites qui répliquent le même contenu tout autour du globe. Beaucoup de pays ont déjà au moins un site CPAN. Les ressources trouvées sur le CPAN sont facilement accessible avec les modules CPANPLUS. Si vous voulez utiliser CPANPLUS, vous devez d'abord le configurer.

source: If there are any additional URLs you would like to use, please add them now. You may enter them separately or as a space delimited list. We provide a default fall-back URL, but you are welcome to override it with e.g. 'http://www.cpan.org/' if LWP, wget or curl is installed. (Enter an empty string when you are done, or to simply skip this step.) Note that if you want to use a local depository, you will have to enter as follows: file://server/path/to/cpan if the file is on a server on your local network or as: file:///path/to/cpan if the file is on your local disk. Note the three /// after the file: bit
fr: Si il y a des URL additionelles que vous voudriez utiliser, ajoutez-les maintenant. Vous pouvez les entrer manuellement ou séparé par des espaces Nous fournissons une url par défault pour se rabattre, mais vous pouvez l'écraser avec ex 'http://www.cpan.org/' si LWP, wget ou lynx sont installés (Entrez une chaine vide quand vous avez fini, ou simplement sautez cette étape.) Remarquez que si vous voulez utiliser un repertory local, vous devez l'entrer comme suit: file://server/path/to/cpan si le fichier est sur votre disque local. Noter les 3 /// après le file:

source: Now we need to know where your favorite CPAN sites are located. Push a few sites onto the array (just in case the first on the array won't work). If you are mirroring CPAN to your local workstation, specify a file: URI by picking the [c] option. Otherwise, let us fetch the official CPAN mirror list and you can pick the mirror that suits you best from a list by using the [m] option; First, pick a nearby continent and country. Then, you will be presented with a list of URLs of CPAN mirrors in the country you selected. Select one or more of those URLs. Note, the latter option requires a working net connection.
fr: Maintenant nous avons besoin de savoir où se trouve vos sites CPAN préférés. Rentrez quelques sites dans le tableau (juste dans le cas où le premier ne fonctionnerait pas) Si vous avez un mirroir du CPAN sur votre station de travail, spécifiez un fichier en utilisant l'option [c]. Sinon, nous allons récupérer la liste officielle des mirroirs CPAN et vous pourrez choisir celui qui convient le mieux dans la liste en utilisant l'option [m]. D'abord choisissez un continent et un pays proche de chez vous. Ensuite choisissez un mirroir dans la liste qui vous sera présenté. Choisissez une ou plusieurs URLs. Remarquez que vous devez avoir avoir une connection Internet valide

source: ### PLEASE NOTE ################################################### Although the core features of CPANPLUS does not require external modules, it may depend on other modules to work according to your configuration. If you skip the probing, or answer 'n' to questions that defaults to 'Y', there might be _unpredictable failures_! ###################################################################
fr: ### ATTENTION ################################################### Meme si les fonctionnalités de base de CPANPLUS ne nécessite pas de modules externes, il peut dépendre d'autres modules pour fonctionner en fonction de votre configuration. Si vous sauter la détection, ou répondez 'n' aux questions qui sont par défault à 'Y', il peut y avoir des _erreurs imprévisibles_ ! ###################################################################

source: ### PLEASE NOTE ################################################### CPANPLUS will replace CPAN.pm in the 5.10 core. Although you should *NOT* expect it to work just like CPAN.pm, there is a compatible shell available. See perldoc CPANPLUS::Shell after installation You are strongly urged to configure CPANPLUS now, since otherwise non-privileged (non-root) users may be unable to use CPANPLUS until you configure it properly. ###################################################################
fr: ### ATTENTION ################################################### CPANPLUS va remplacer CPAN.pm dans perl 5.10. Meme si il n'est pas censé fonctionner exactement comme CPAN.pm, il y a un shell compatible. Voir perldoc CPANPLUS::Shell après l'installation Vous êtes vivement encouragé à configurer CPANPLUS maintenant, sinon les utilisateurs non privilégiés (non-root) peuvent être incapable d'utiliser CPANPLUS tant que vous ne l'aurez pas configuré correctement. ###################################################################

source: Although we recommend an interactive configuration session, you can also enter 'n' here to use default values for all questions.
fr: Même si nous recommandons une session interactive pour la configuration vous pouvez entrez 'n' ici et utiliser les valeurs par défaut pour toutes les questions.

source: CPANPLUS has support for the Test::Reporter module, which can be utilized to report success and failures of modules installed by CPANPLUS. Would you like to do this? Note that you will still be prompted before sending each report.
fr: CPANPLUS supporte le module Test::Reporter, qui peut-être utilisé pour reporter les succès ou échecs des modules installé par CPANPLUS. Voulez vous l'utiliser? Remarquez que vous serez intérrogé avant d'envoyer chaque report.

source: If you are connecting through a firewall or proxy that doesn't handle FTP all that well you can use passive FTP.
fr: Si vous êtes connecté à travers un firewall ou un proxy qui ne gère pas tous les FTP, vous pouvez utiliser le FTP passif.

source: If you like, CPAN++ can add extra directories to your @INC list starts during startup. Enter a space separated list of list to be added to your @INC, quoting anything with embedded whitespace. (To clear the current value enter a single space.)
fr: Si vous le désirez, CPAN++ peut ajouter des répertoires supplémentaires à @INC au moment du démarrage. Entrez une liste séparées pas des espaces pour les ajouter à @INC, coter les espaces superflus voulus. (Pour effacer les répertoires existants, ajoutez un espace seul.)

source: In normal operation I can just give you basic information about what I am doing, or I can be more verbose and give you every little detail.
fr: En temps normal, je donne juste des informations basiques sur ce que je fais, ou je peux être plus bavard et vous donnez tous les petits détails.

source: In the interest of speed, we keep track of what modules were installed successfully and which failed in the current session. We can flush this data automatically, or you can explicitly issue a 'flush' when you want to purge it.
fr: Dans un intêret de vistesse, nous gardons une trace de quel module a été installé avec succès and quel module a échoué dans sa version courante. Nous pouvons vider ces données automatiquement, ou explicitement faire un 'flush' quand vous voulez le purger.

source: Like Makefile.PL, we run 'make' and 'make install' as separate processes. If you have any parameters (e.g. '-j3' in dual processor systems) you want to pass to the calls, please specify them here. In particular, 'UNINST=1' is recommended for root users, unless you have fine-tuned ideas of where modules should be installed in the \@INC path. Enter a name=value list separated by whitespace, but quote any embedded spaces that you want to preserve. (Enter a space to clear any existing settings.) Again, if you don't understand this question, just press ENTER.
fr: Comme pour le Makefile.PL, 'make' et 'make install' sont lancés dans des processus séparés. Si vous avez des paramêtres (ex '-j3' dans les systemes multi-processeurs) que vous voulez passer à l'appel de make, les spécifier ici. En particulier, 'UNINST=1' est recommandé pour l'utilisateur root, à moins que vous savez très bien où les modules vont être installés dans le chemin de \@INC. Entrez une liste de nom=valeur séparée par des espaces, mais coter tous les espaces que vous voulez préserver. (Entrez un espace pour effacer tous les réglages.) A nouveau, si vous ne comprenez pas cette questions, appuyez juste sur ENTER.

source: Makefile.PL is run by perl in a separate process, and accepts various flags that controls the module's installation. For instance, if you would like to install modules to your private user directory, set 'makemakerflags' to: LIB=~/perl/lib INSTALLMAN1DIR=~/perl/man/man1 INSTALLMAN3DIR=~/perl/man/man3 and be sure that you do NOT set UNINST=1 in 'makeflags' below. Enter a name=value list separated by whitespace, but quote any embedded spaces that you want to preserve. (Enter a space to clear any existing settings.) If you don't understand this question, just press ENTER.
fr: Comme pour le Makefile.PL, 'make' et 'make install' sont lancés dans des processus séparés. Si vous avez des paramêtres (ex '-j3' dans les systemes multi-processeurs) que vous voulez passer à l'appel de make, les spécifier ici. En particulier, 'UNINST=1' est recommandé pour l'utilisateur root, à moins que vous savez très bien où les modules vont être installés dans le chemin de \@INC. Entrez une liste de nom=valeur séparée par des espaces, mais coter tous les espaces que vous voulez préserver. (Entrez un espace pour effacer tous les réglages.) A nouveau, si vous ne comprenez pas cette questions, appuyez juste sur ENTER.

source: Now, we are going to fetch the mirror list for first-time configurations. This may take a while...
fr: Maintenant, nous allons récupérer une liste de mirroirs pour la première configuration. Cela peut prendre du temps...

source: Sometimes a module will require other modules to be installed before it will work. CPAN++ can attempt to install these for you automatically if you like, or you can do the deed yourself. If you would prefer that we NEVER try to install extra modules automatically, select NO. (Usually you will want this set to YES.) If you would like to build modules to satisfy testing or prerequisites, but not actually install them, select B[uild]. NOTE: This feature requires you to flush the 'lib' cache for longer running programs (refer to the CPANPLUS::Backend documentations for more details). Otherwise, select ASK to have us ask your permission to install them.
fr: Parfois, un module va nécessiter que d'autres modules soient installés au préalable pour fonctionner. CPAN++ peut essayer d'installer ces modules pour vous automatiquement si vous voulez, ou vous pouvez faire le travail vous-même. Si vous préférez ne JAMAIS essayer d'installer les modules supplémentaires automatiquement, choisissez NO. (Habituellement, vous voulez YES.) Si vous voulez construire les modules pour faire les tests ou satisfaire les prérequis, mais sans les installer, choisissez B[uild]. Remarquez que cette fonctionnalité nécessite le flush du cache 'lib' pour un fonctionnement pérein des programmes. (référez vous à la documentation de CPANPLUS::Backend pour plus de détails). Sinon, choisissez ASK pour que l'on vous demande la permission d'installer un module.

source: The CPAN++ module needs a directory of its own to cache important index files and maybe keep a temporary mirror of CPAN files. This may be a site-wide directory or a personal directory.
fr: Le module CPAN++ nécessite un répertoire pour cacher l'index de fichiers importants et peut-être garder un mirroir temporaire des fichiers du CPAN .Cela peut-etre un répertoire serveur ou un répertoire personnel.

source: The Module::Signature extension allows CPAN authors to sign their distributions using PGP signatures. Would you like to check for module's cryptographic integrity before attempting to install them? Note that this requires either the 'gpg' utility or Crypt::OpenPGP to be installed.
fr: Le module Module::Signature permet aux auteurs CPAN de signer leur distribution à l'aide de signatures PGP. Voulez-vous vérifiez l'intégrité des modules avant de les installer? Remarquez que cela nécessite que le programme 'gpg' ou le module Crypt::OpenPGP soit installé.

source: The modules in the CPAN archives are protected with md5 checksums.
fr: Les modules du CPAN sont protégés par des checksums MD5.

source: To speed up the start time of CPAN++ we can use Storable to freeze some information. Would you like to do this?
fr: Pour accélerer le départ de CPAN++, nous pouvons utiliser Storable pour garder certaines informations. Voulez-vous faire cela?

source: Usually, when a test fails, I won't install the module, but if you prefer, I can force the install anyway.
fr: Habituellement, lorsque un test échoue, je ne vais pas installer le module, mais si vous préférez, je peux forcer l'installation malgré tout.

source: What email address should we send as our anonymous password when fetching modules from CPAN servers? Some servers will NOT allow you to connect without a valid email address, or at least something that looks like one. Also, if you choose to report test results at some point, a valid email is required for the 'from' field, so choose wisely.
fr: Quelle adresse mail je peux envoyer comme mot de passe pour anonymous quand je récupère des modules depuis un serveur CPAN? Certains serveurs ne permettent pas de vous connecter sans une valide adresse mail, ou au moins quelque chose qui y ressemble.

source: Which '%1' executable should I use? 1) %2 2) %3 3) other
fr: Quel executable '%1' je peux utiliser? 1) %2 2) %3 3) autre

source: You have several choices: 1) %1 2) %2 3) something else
fr: Vous avez plusieurs choix: 1) %1 2) %2 3 autre chose

source: ! EXPR # evaluate a perl statement
fr: ! EXPR # evalue une expression perl

source: a AUTHOR ... # search by author(s)
fr: a AUTHOR ... # recherche par auteur(s)

source: b # write a bundle file for your configuration
fr: b # ecrit un fichier bundle pour votre configuration

source: c MODULE | NUMBER ... # check for module report(s) from cpan-testers
fr: c MODULE | NUMBER ... # verifie les report(s) des cpan-testers sur le module

source: d MODULE | NUMBER ... # download module(s) into current directory
fr: d MODULE | NUMBER ... # télécharge le(s) module(s) dans le répertoire courant

source: e DIR ... # add directories to your @INC
fr: e DIR ... # ajoute des répertoires à @INC

source: f AUTHOR ... # list all distributions by author(s)
fr: f AUTHOR ... # liste toutes les distributions par auteur(s)

source: h | ? # display help
fr: h | ? # affiche l'aide

source: i MODULE | NUMBER ... # install module(s), by name or by search number
fr: i MODULE | NUMBER ... # installe le(s) module(s), par nom ou par numero de recherche

source: l MODULE | NUMBER ... # display detailed information about module(s)
fr: l MODULE | NUMBER ... # affiche des informations détaillées sur le(s) module(s)

source: m MODULE ... # search by module(s)
fr: m MODULE ... # recherche par module(s)

source: o [ MODULE ... ] # list installed module(s) that aren't up to date
fr: o [ MODULE ... ] # liste le(s) module(s) installés qui ne sont pas à jour

source: p [FILE] # print the error stack (optionally to a file)
fr: p [FILE] # affiche la pile d'erreurs (optionellement dans un fichier)

source: q # exit
fr: q # sortie

source: r MODULE | NUMBER ... # display README files of module(s)
fr: r MODULE | NUMBER ... # Affiche les fichiers README des module(s)

source: s [OPTION VALUE] # set configuration options for this session
fr: s [OPTION VALUE] # positionne les options de configuration pour cette session

source: s conf | save # reconfigure settings / save current settings
fr: s conf | save # reconfigure les options / sauve les options courantes

source: t MODULE | NUMBER ... # test module(s), by name or by search number
fr: t MODULE | NUMBER ... # teste le(s) module(s), par nom ou par numero de recherche

source: u MODULE | NUMBER ... # uninstall module(s), by name or by search number
fr: u MODULE | NUMBER ... # deinstalle le(s) module(s), par nom ou par numéro de recherche

source: v # version information
fr: v # information sur le no de version

source: w # display the result of your last search again
fr: w # re-affiche le résultat de votre dernière recherche

source: x # reload CPAN indices
fr: x # recharge les indices CPAN

source: z MODULE | NUMBER ... # extract module(s) and open command prompt in it
fr: z MODULE | NUMBER ... # extrait le(s) module(s) et ouvre un prompt dessus

source: in %1 at %2
fr: dans %1 le %2

source: %1 -- CPAN exploration and modules installation (v%2)
fr: %1 -- Exploration et installation de modules CPAN (v%2)

source: %1 already exists, not running 'perl %2' again, unless you force!
fr: %1 existe déjà, je ne lance pas 'perl %2' à nouveau, à moins que l'on m'y force

source: %1 already tested and declared as UNKNOWN two times; skipping.\n
fr: %1 déjà testé et déclaré UNKNOWN 2 fois, sauté.

source: %1 already tested on this configuration; skipping.\n
fr: %1 déjà testé sur cette configuration; sauté.\n

source: %1 already tested on this machine; skipping.\n
fr: %1 déjà testé sur cette machine; sauté. \\n

source: %1 could not be added by Archive::Zip
fr: %1 ne peut être ajouté par Archive::Zip

source: %1 couldn't chdir to %2! I am in %3 now
fr: %1 ne peut faire cd dans %2! Je suis dans %3 maintenant

source: %1 does not contain an author directory!
fr: %1 ne contient pas de repertoire d'auteurs

source: %1 does not exist, can not PPMify it!
fr: %1 n'existe pas, impossible d'en faire un PPM

source: %1 has no size!
fr: %1 n'a pas de taille!

source: %1 has zero size! Can not extract!
fr: %1 a une taille de 0! Impossible d'extraire!

source: %1 installed succesfully
fr: %1 installé avec succès

source: %1 installed successfully
fr: %1 installé avec succès

source: %1 is a required module for this install.
fr: %1 est un module necéssaire pour l'install

source: %1 is not a proper distribution name!
fr: %1 n'est pas un nom de distribution correct!

source: %1 is not writable
fr: %1 n'a pas les droits en écriture

source: %1 is up to date
fr: %1 est à jour

source: %1 not available
fr: %1 n'est pas disponible

source: %1 not writable; skipped.
fr: %1 n'a pas les droits en écriture, sauté.

source: %1 said it fetched %2, but it was not created!
fr: La méthode %1 dit que %2 a été retiré, mais il n'a pas été créé!

source: %1 uninstalled succesfully
fr: desinstallation de %1 avec succès

source: %1 was set to %2
fr: %1 a été positionné à %2

source: %1 was set to:
fr: %1 a été positionné à:

source: '%1' is not a valid configuration option!
fr: '%1' n'est pas une option de configuration valide!

source: '%1' is not a valid option for %2
fr: '%1' n'est pas une option valide pour %2

source: '%1' is not an existing accessor for '%2'
fr: '%1' n'est pas un nom existant pour atteindre '%2'

source: '%1' is not of a valid type for %2, using default instead!
fr: '%1' n'est pas un type valide pour %2, utilisation valeur par défault à la place

source: *** Error: CPANPLUS %1 was not configured properly, and we cannot write to %2
fr: *** Erreur: CPANPLUS %1 n'est pas configuré correctement, and je ne peux ecrire dans %2

source: *** Please check its permission, or contact your administrator.
fr: *** Vérifiez les droits, ou contactez votre administrateur.

source: *** Please report bugs to <cpanplus-bugs\@lists.sourceforge.net>.
fr: *** Merci de faire suivre les bugs à <cpanplus-bugs\@lists.sourceforge.net>.

source: *** Using CPANPLUS::Backend v%1. %2
fr: *** Utilisation de CPANPLUS::Backend v%1. %2

source: *** You can view the complete error buffer by pressing '%1' ***\n
fr: *** Vous pouvez voir l'erreur complète en pressant '%1' ***\n

source: *nothing entered*
fr: *aucune entrée*

source: .zip files support
fr: Support des fichiers .zip

source: /bin/tar solution not yet implemented, sorry!
fr: solution /bin/tar non encore implémenté, désolé!

source: A previous installation detected. Use its settings? [Y/n]:
fr: Installation précédente détectée. Utiliser ses réglages? [Y/n]:

source: Abandoned; volunteers welcome to take over maintainance
fr: Abandonné; Volontaires bienvenus pour prendre la maintenance

source: According to the cache, %1 failed to install before in this session.. returning!
fr: D'après le cache, %1 a échoué à l'installation auparavant dans cette cession.. Je rend la main!

source: According to the cache, prerequisite %1 is already installed
fr: D'après le cache, le prérequis %1 est déjà installé

source: Additional @INC directories to add? [%1]
fr: Répertoires additionnels pour @INC? [%1]

source: Additional host(s) to add [%1]:
fr: Machines supplémentaires à ajouter [%1]:

source: Additional host(s) to add:
fr: Nom de machine(s) à ajouter

source: All cached data has been flushed
fr: Toutes les données en cache ont été écrites

source: All files downloaded successfully
fr: Tous les fichiers ont été téléchargés avec succès

source: All module(s) up to date.
fr: Tous les modules sont à jour.

source: All modules uninstalled successfully
fr: Tous les modules ont été déinstallés avec succès

source: Alpha testing
fr: Phase de test Alpha

source: Already attempted to use '%1', which was unsuccessful
fr: J'ai déjà essayé d'utiliser '%1', sans succès.

source: Already downloaded %1, won't download again without force
fr: Déjà téléchargé %1, je vais pas le retélécharger sans mode force

source: Already extracted '%1' to '%2'. Won't extract again without force
fr: Déjà extrait '%1' dans '%2'. Je ne vais pas le faire à nouveau sans le mode force

source: Already ran 'make' for this module. Not running again unless you force!
fr: Déjà lancé 'make' pour ce module. Je ne vais le lancer à nouveau sans le mode force

source: An error occurred extracting %1: %2
fr: Une erreur est survenue en extrayant %1: %2

source: An error occurred handling bundle %1
fr: Une erreur est survenue en traitant le bundle %1

source: An error occurred handling module %1
fr: Une erreur est survenue en traitant le module %1

source: An error occurred while compressing the blib/ directory
fr: Une erreur est survenue en décompressant le répertoire blib/

source: An error occurred while creating the README file
fr: Une erreur est survenue en créant le fichier README

source: An error occurred while installing bundles from %1
fr: Une erreur est survenue lors de l'installation de bundles pour %1

source: An error occurred while writing the .pdd file
fr: Une erreur est survenue lors de l'écriture du fichier .ppd

source: An error occurred while zipping a distribution
fr: Une erreur est survenue en zippant la distribution

source: Are you ready for manual configuration?
fr: Etes-vous prêt pour une configuration manuelle?

source: Array reference passed, but 'to' only takes one argument.
fr: Une reférence de tableau est passé, mais 'to' prend seulement un argument.

source: Artistic license alone
fr: License Artistic seule

source: Author did not supply a %1 - Attempting to generate one
fr: L'auteur n'a pas fourni de %1 - On essaye d'en générer un

source: Available options and their current values are:
fr: Les options disponibles et leurs valeurs courantes sont:

source: BSD: The BSD License
fr: BSD: La License BSD

source: BUILDING %1 failed! - %2
fr: CONSTRUCTION %1 echoué! - %2

source: Beta testing
fr: Beta test

source: Build directory %1 doesn't look like an RPM build root
fr: Le répertoire de build %1 ne ressemble à répertoire de build RPM

source: Build options saved\n
fr: Option de build sauvegardé\n

source: Built %1
fr: Construction de %1
