Repository: canada/perlpod
Catalog: docs/modules/CPANPLUS-0.043/*.po
Languages: fr

source: C and perl, a C compiler will be needed
fr: C et perl, un compilateur C est nécessaire

source: C++ and perl, a C++ compiler will be needed
fr: C++ et perl, un compilateur C++ va être utilisé

source: CPAN Terminal
fr: Terminal CPAN

source: CPAN Test reporting
fr: Report des tests CPAN

source: CPAN tells us the following about %1:
fr: CPAN nous raconte ce qui suit sur %1:

source: Cached metadata
fr: Métadonnées en cache

source: Can not open %1: %2
fr: Impossible d'ouvrir %1: %2

source: Can't check version on %1... assuming it's up to date
fr: Ne peut vérifier la version de %1... On assume qu'il est à jour

source: Can't find %1: %2
fr: Ne peut trouver %1: %2

source: Can't open %1: %2
fr: Impossible d'ouvrir %1: %2

source: Can't open[r/w] %1: %2
fr: Impossible d'ouvrir%r(,/w) %1: %2

source: Can't rewind %1: %2
fr: Ne peut faire un rewind sur %1: %2

source: Can't send report: %1
fr: Impossible d'envoyer le report: %1

source: Can't truncate %1: %2
fr: Ne peut tronquer %1: %2

source: Can't use Backend!
fr: Impossible d'utiliser Backend!

source: Can't use File::* functions. They should be core modules!
fr: Ne peut utiliser les fonctions de File::*. Cela doit être des modules du core!

source: Can't use LWP
fr: Impossible d'utiliser LWP

source: Can't use Net::FTP
fr: Impossible d'utiliser Net::FTP

source: Can't write to %1: %2
fr: Impossible d'écrire dans %1: %2

source: Cannot determine prerequisites - Aborting
fr: Impossible de déterminer les prérequis - Avorté

source: Cannot fetch %1 (part of core perl distribution); skipping
fr: Ne peut récupérer %1 (partie du core de la distribution perl); non traité

source: Cannot fetch %1 without a working '%2' executable!
fr: Ne peut récupérer %1 sans l'executable '%2' qui fonctionne!

source: Cannot fetch %1; '%2' resolve failed!
fr: Ne peut récupérer %1; résolution de '%2' échouée

source: Cannot find %1 in the module tree!
fr: Ne peut trouver %1 dans l'arbre des modules

source: Cannot find distribution for %1, skipping
fr: Ne peut trouver une distribution pour %1, ignoré

source: Cannot install bundled module: %1 does not exist!
fr: Ne peut installer le module bundle: %1 n'exite pas!

source: Cannot unlink old config file '%1', continuing anyway.
fr: Ne peut suprimer l'ancien fichier de configuration '%1', poursuite quand même

source: Cannot write to %1
fr: Impossible d'écrire dans %1

source: Caught SIGINT
fr: Recu le signal SIGINT

source: Check module signatures?
fr: Verifier les signatures des modules ?

source: Check your installation!
fr: Vérifiez votre installation!

source: Checking PPD...
fr: Vérification du PPD

source: Checking if source files are up to date
fr: Verification si les fichiers sources sont à jour

source: Checksum for %1 OK
fr: Checksum pour %1 OK

source: Checksums did not match for %1
fr: Checksum ne correspond pas pour %1

source: Choose another? [Y/n]:
fr: Choisir un autre? [Y/n]:

source: Configuration file name:
fr: Nom du fichier de configuration:

source: Could no get %1 for %2: %3
fr: Ne peut récupérer %1 pour %2: %3

source: Could not chdir back to %1 from %2: %3
fr: Impossible de revenir dans le répertoire %1 depuis %2:%3

source: Could not chdir from %1 to %2: %3
fr: Impossible de faire un cd depuis %1 vers %2: %3

source: Could not chdir into %1
fr: Impossible de faire un cd dans %1

source: Could not close %1: %2
fr: Ne peut fermer %1: %2

source: Could not copy %1 to %2: %3 %4
fr: Ne peut copier %1 vers %2: %3 %4

source: Could not create %1
fr: Ne peut créer %1

source: Could not create Archive::Zip object
fr: Ne peut créer un objet Archive::Zip

source: Could not create Makefile.PL - %1
fr: Ne peut créer Makefile.PL - %1

source: Could not create an ExtUtils::Installed object
fr: Ne peut créer un objet ExtUtils::Installed

source: Could not delete %1, some methods may fail to force a download
fr: Ne peut supprimer %1, certaines méthodes peuvent échouer un téléchargement forcé

source: Could not determine what dir %1 was built in
fr: Ne peut déterminer quel répertoire %1 a été construit dans

source: Could not determine where %1 was extracted to
fr: Ne peut déterminer où %1 a été extrait

source: Could not find a .ppd file in %1!
fr: Ne peut trouver un fichier .ppd dans %1!

source: Could not find distributions for %1
fr: Ne peut trouver une distribution pour %1

source: Could not find installation files for all the modules
fr: Ne peut trouver les fichiers d'installation pour tous les modules

source: Could not generate %1 - Aborting
fr: Ne peut générer %1 - Annulé

source: Could not get files for %1
fr: Ne peut ramener les fichiers pour %1

source: Could not load your personal config: %1: %2
fr: Ne peut charger votre configuration personnelle: %1: %2

source: Could not move %1 to %2: %3
fr: Ne peut déplacer %1 vers %2: %3

source: Could not obtain extraction directory for module %1
fr: Impossible d'obtenir le répertoire d'extraction pour le module %1

source: Could not open %1 for reading: %2
fr: Impossible d'ouvrir %1 en lecture: %2

source: Could not open %1 for writing: %2
fr: Impossible d'ouvrir %1 pour écriture: %2

source: Could not open %1: %2
fr: Impossible d'ouvrir %1: %2

source: Could not read dir name from %1
fr: Ne peut lire le nom du répertoire depuis %1

source: Could not run command: %1
fr: Ne peut lancer la commande: %1

source: Could not uninstall %1
fr: Ne peut déinstaller %1

source: Could not use File::Path! This module should be core!
fr: Ne peut utiliser le File::Path! Ce module doit faire partie du core!

source: Could not write to %1: %2
fr: Ne peut écrire dans %1: %2

source: Couldn't fetch %1 from %2
fr: Impossible de récupérer %1 depuis %2

source: Couldn't get a name for %1
fr: Impossible de récupérer un nom pour %1

source: Couldn't get a version for %1
fr: Ne peut récupérer une version pour %1

source: Couldn't open %1 for writing.
fr: Ne peut ouvrir %1 pour écriture

source: Couldn't open %1: %2
fr: Ne peut ouvrir %1: %2

source: Couldn't touch %1
fr: Ne peut faire un touch sur %1

source: Couldn't write to %1: %2
fr: Ne peut écrire dans %1: %2

source: Currently selected hosts:
fr: Machines actuellement sélectionnées:

source: Curses Shell
fr: Shell Curses

source: Details for %1
fr: Détails pour %1

source: Developer
fr: Développeur

source: Direct access to private method %1 is forbidden
fr: Accès direct à la méthode privée %1 est interdite

source: Do you want to configure CPANPLUS now?
fr: Est-ce que vous voulez configurer CPANPLUS maintenant ?

source: Don't know what dir to build in!
fr: Impossible de déterminer dans quel répertoire construire !

source: Email address:
fr: Adresse mail:

source: Error creating %1 dist for %2
fr: Erreur en créant la distribution %1 pour %2

source: Error creating %1 from %2
fr: Erreur en créant %1 depuis %2

source: Error executing your subshell: %1
fr: Erreur à l'execution du sous-shell: %1

source: Error fetching %1
fr: Erreur en récupérant %1

source: Error from child: $!
fr: Erreur du processus fils: $!

source: Error from child: %1
fr: Erreur du fils: %1

source: Error in eval of dslip source files: %1
fr: Erreur dans l'évaluation de fichiers source dlisp: %1

source: Error installing %1 as %2
fr: Erreur en installant %1 en tant que %2

source: Error installing bundle %1
fr: Erreur à l'installation du bundle %1

source: Error installing module %1
fr: Erreur en installant le module %1

source: Error parsing testers.cpan.org results
fr: Erreur au parsing du résultat de testers.cpan.org

source: Error rebuilding trees!
fr: Erreur dans la reconstruction de l'arborescence!

source: Error removing %1: %2
fr: Erreur en supprimant %1: %2

source: Error saving your configuration
fr: Erreur en sauvant votre configuration

source: Error validating input to 'CPANPLUS::Backend::RV'
fr: Erreur en validant l'entrée de ''CPANPLUS::Backend::RV'

source: Error while validating %1: %2
fr: Erreur en validant %1: %2

source: Error: %1 is contained within Perl itself!
fr: Erreur: %1 est contenu dans Perl lui-même!

source: Error: %1 says 'Contact Author'
fr: Erreur: %1 dit 'Contacter l'auteur'

source: Error: No file for %1
fr: Erreur: Pas de fichier pour %1

source: Exiting CPANPLUS shell
fr: Sortie du shell CPANPLUS

source: Extracting %1
fr: Extration de %1

source: Extraction of %1 from %2 failed
fr: Extraction de %1 depuis %2 échoué

source: FAIL status already reported. I won't cc the author.
fr: Status FAIL déjà reporté. Je ne met pas l'auteur en cc.

source: Failed to create zip file for %1
fr: Impossible de créer un fichier zip pour %1

source: Failed to save build options\n
fr: Sauvegarde des options de build échoué

source: Failed to use %1: %2
fr: Ne peut utiliser %1: %2

source: Falling back to system-wide config.
fr: Retour à la configuation système

source: Fetch failed! HTTP response code: %1 [%2]
fr: Téléchargement échoué! Code réponse HTTP: %1 [%2]

source: Fetch failed: host list exhausted - are you connected today?
fr: Récupération échouée: liste de machines épuisées - vous êtes connectés ?

source: Fetch failed: no way to download source file!
fr: Récupération échoué: pas de moyen de télécharger le fichier source

source: Fetch of %1 failed!
fr: Récupération de %1 échoué!

source: Fetch report failed on %2: %1
fr: Echec à la récupération du rapport sur %2: %1

source: Fetch report failed: %1
fr: Récupération du report échoué: %1

source: Fetching
fr: Récupération

source: Fetching '%1' from %2. It may take a few minutes...
fr: Récupération de '%1' depuis %2. Cela peut prendre quelques minutes...

source: Fetching new indices and rebuilding the module tree
fr: Récupération des nouveaux indices de module et reconstruction de l'arbre de modules

source: Fetching of %1 failed
fr: Récupération de %1 échoué

source: Fetching of %1 successful
fr: Récupération de %1 avec succès

source: Fetching: %1
fr: Recupération: %1

source: File '%1' was not created: %2
fr: Fichier '%1' n'est pas créer: %2

source: File creation failed: %1
fr: Création de fichier échoué: %1

source: File::RsyncP support
fr: Support de File::RsyncP

source: First of all, I'd like to create this directory. Where?
fr: D'abord, je voudrais créer ce répertoire. Où?

source: Flush automatically?
fr: Vider le cache automatiquement?

source: Follow prereqs?
fr: Suivre les prérequis?

source: Force installs?
fr: Forcer les installations?

source: Good, I found '%1' in your PATH:
fr: Mon dieu, j'ai trouvé '%1' dans votre PATH:

source: Got another SIGINT
fr: Recu un autre SIGINT

source: Gunzipping %1
fr: Gunzip sur %1

source: Hello, %1!
fr: Salut, %1

source: Here is a listing of your previous search result:
fr: Voici un listing du résultat de votre précédente recherche:

source: Host %1 already selected!
fr: Machine %1 déjà sélectionné

source: Hybrid, written in perl with optional C code, no compiler needed
fr: Hybride, écrit en perl avec du code optionnel C, pas de compilateurnécessaire

source: I am NOT going to use Storable.
fr: Je ne vais PAS utiliser use Storable

source: I can not write to %1, I don't have permission.
fr: Je ne peux écrire dans %1, je n'ai pas la permission

source: I can't seem to write in this directory.
fr: Je ne peux pas écrire dans ce répertoire.

source: I couldn't find '%1' in your PATH.
fr: Je ne peux trouver '%1' dans votre PATH

source: I found %1 in your path, would you like to use it for '%2'?
fr: J'ai trouvé %1 dans votre path, vous voulez l'utiliser pour '%2' ?

source: I see you already have a directory:
fr: Je vois que vous avez déjà un répertoire:

source: I see you already have this file. It is writable. Shall I overwrite it?
fr: Je vois que vous avez déjà ce fichier. Il a les droits en écriture. Est-ce que je peux l'écraser ?

source: I wasn't able to create %1.
fr: Je ne suis pas capable de créer %1.

source: I will ask permission to install prereqs.
fr: Je vais demander la permission d'installer les prérequis

source: I will attempt to check module signatures.
fr: Je vais essayer de vérifier les signatures des modules.

source: I will force installs.
fr: Je vais forcer les install

source: I will install prereqs.
fr: Je vais installer les prérequis.

source: I will only build and not install prereqs.
fr: Je vais seulement construire et ne pas installer les prérequis.

source: I will prompt you to report test results.
fr: Je vous demanderai de reporter les résultats des tests

source: I will use Storable if you have it.
fr: Je vais utiliser Storable si vous l'avez.

source: I will use md5 if you have it.
fr: Je vais utiliser md5 si vous l'avez.

source: I will use passive FTP.
fr: Je vais utiliser le FTP passif.

source: I won't attempt to check module signatures.
fr: Je n'essaierai pas de vérifier les signatures des modules.

source: I won't flush until you tell me to. (It could get smelly in here! ;o)
fr: Je ne vais pas nettoyer tant que vous ne le dites pas (Ca va sentir mauvais! ;o)

source: I won't force installs.
fr: Je ne vais pas forcer les installs.

source: I won't install prereqs.
fr: Je ne vais pas installer les prérequis.

source: I won't prompt you to report test results.
fr: Je ne vous demanderai pas de reporter les résultats des tests.

source: I won't use md5 if you have it.
fr: Je ne vais pas utiliser md5

source: I won't use passive FTP.
fr: Je ne vais pas utiliser de FTP passif.

source: I'll flush after every full module install.
fr: Je vais nettoyer avec chaque installation complète de modules.

source: I'll try to be quiet.
fr: Je vais essayer d'être discret.

source: I'm sorry, '%1' is not a valid option, please try again
fr: Je suis désolé, '%1' n'est pas une option valide, réessayer

source: IDs do not match: %1 != %2. Storage failed!
fr: Les ID ne correspondent pas: %1 != %2. Stockage échoué!

source: IO::Select error
fr: Erreur dans IO::Select

source: IPC::Run support
fr: Support IPS::Run

source: Idea, listed to gain consensus or as a placeholder
fr: Idée, listé pour obtenir un consensus ou un endroit quelque part

source: Improper command '%1'. Usage:
fr: Commande incorrecte '%1'. Usage:

source: Install of %1 failed in %2
fr: Installation de %1 échoué dans %2

source: Installing
fr: Installation

source: Installing %1 failed!
fr: Installation de %1 échoué!

source: Installing %1 to satisfy dependency
fr: Installation de %1 pour satisfaire les dépendances

source: Installing %2 failed!
fr: Echec de l'installation %2 !

source: Installing bundled module: %1
fr: Installation du module bundle: %1

source: Installing of %1 failed
fr: Installation de %1 échoué

source: Installing of %1 successful
fr: Installation de %1 avec succès

source: Invalid method type: '%1'
fr: Type de méthode invalide: '%1'

source: Invalid selection, please try again.
fr: Sélection invalide, choisissez à nouveau.

source: Invalid selection, please try again:
fr: Sélection invalide, re-essayer à nouveau:

source: Invalid start dir!
fr: Réperoire de départ invalide!

source: Key '%1' is not a valid key for %2 provided by %3
fr: La clef '%1' n'est pas un clef valide pour %2 fournie par %3

source: LGPL: "GNU Lesser General Public License" (previously known as "GNU Library General Public License")
fr: LGPL: "GNU Lesser General Public License" (appelé auparavant "GNU Library General Public License")

source: LWP & CPAN test query
fr: LWP & interrogation des tests du CPAN

source: Let the installer probe for module dependencies?
fr: Laisser l'installeur vérifier les dépendances des modules?

source: Local file support
fr: Support fichier local

source: Localized messages
fr: Messages des langues

source: Location of the Configuration file [1]:
fr: Répertoire du fichier de configuration [1]:

source: MAKE INSTALL failed! - %1
fr: MAKE INSTALL échoué! - %1

source: MAKE TEST failed! - %1
fr: MAKE TEST échoué! - %1

source: MAKE failed! - %1
fr: MAKE échoué - %1

source: MD5 checksum
fr: checksum MD5

source: MD5 sums did not add up for %1
fr: Le checksum MD5 ne convient pas pour %1

source: Make couldn't chdir to %1! I am in %2 now
fr: Make de peut rentrer dans le rep %1! Je suis maintenant dans %2

source: Makefile already exists, not running 'perl Makefile.PL' again, unless you force!
fr: Makefile existant, je ne lance pas 'perl Makefile.PL' sans mode force!

source: Making %1 failed!
fr: Fabrication de %1 échoué

source: Malformed CHECKSUM line: %1
fr: CHECKSUM malformé ligne: %1

source: Manually configure CPANPLUS based on previous settings?
fr: Configurer manuellement CPANPLUS en se basant sur les réglages précédents?

source: Mature (no rigorous definition)
fr: Mature (pas de définition rigoureuse)

source: Missing key %1
fr: Clef manquante %1

source: Module %1 already up to date;
fr: Module %1 est déjà à jour;

source: Module %1 not installed! Can not validate!
fr: Module %1 non installé! Ne peut valider!

source: Moving %1 to %2
fr: Déplacement de %1 vers %2

source: Net::FTP support
fr: Support Net::FTP

source: No README found for %1
fr: Pas de README trouvé pour %1

source: No README found for your query
fr: Pas de README trouvé pour votre requête

source: No authors found for your query
fr: Pas d'auteurs trouvés pour votre requête.

source: No cache limit entered, ignoring dir size
fr: Pas de limite de cache entrée, taille du répertoire ignoré

source: No details for %1 - it's probably outdated.
fr: Pas de détails pour %1 - il est problablement obsolète

source: No directory tree found for %1!
fr: Pas d'arborescence trouvée pour %1!

source: No files found for %1!
fr: Pas de fichiers trouvés pour %1!

source: No module specified!
fr: Pas de modules spécifiés!

source: No modules mentioned in %1
fr: Pas de modules mentionnés dans %1

source: No modules to check.
fr: Pas de modules à vérifier.

source: No remote file given to download!
fr: Pas de fichier distant donné à télécharger!

source: No reports available for this distribution.
fr: Pas de reports disponible pour cette distribution.

source: No search was done yet!
fr: Pas de recherche effectuée pour le moment!

source: No search was done yet.
fr: Aucune recherche effectuée actuellement.

source: No such method %1
fr: Pas de méthode %1

source: No such module: %1
fr: Pas de module: %1

source: No such module: %1, cannot satisfy dependency
fr: Pas de module: %1, ne peut satisfaire les dépendances

source: No such module: %1, skipping.\n
fr: Pas de module: %1, sauté. \n

source: No valid hostname entered!
fr: Pas de nom de machine valide entrée!

source: No valid path or scheme entered!
fr: Pas de chemin valide ou module rentré!

source: None
fr: Rien

source: None given
fr: Rien n'a été donné

source: None known, try comp.lang.perl.modules
fr: Rien de connu, essayer comp.lang.perl.modules

source: Now, please type '%1' to test, and %2 to install.
fr: Maintenant, essayez de taper '%1' pour les tests, et %2 pour l'installation.

source: Now, please type '%1' to test, and '%2' to install.
fr: Maintenant, taper '%1' pour tester, et '%2' pour installer.

source: OK, I will save your Configure file to:
fr: OK, Je vais sauver votre fichier de configuration dans:

source: Object oriented using blessed references and/or inheritance
fr: Orienté objet en utilisant les références consacrées et/ou l'héritage

source: Okay, existing settings are preserved.
fr: Ok, les réglages existants vont être préservés.

source: Old settings detected. Do you want to modify it?
fr: Ancienne configuration détectée, voulez-vous la modifier ?

source: Opening shell for module
fr: Ouverture d'un shell pour le module

source: PGP signatures
fr: signatures PGP

source: Parameters for %1 [%2]:
fr: Paramètres pour %1 [%2]:

source: Parameters for %1:
fr: Paramètres pour %1:

source: Perhaps you need to re-run your setup?
fr: Peut-être devriez-vous relancer votre setup?

source: Perl-only, no compiler needed, should be platform independent
fr: Seulement Perl, pas de compilateur nécessaire, peut-être plateformeindépendant

source: Please choose 1, 2, or 3 [1]:
fr: Choisissez 1, 2, ou 3 [1]:

source: Please choose a continent [%1]:
fr: Choisissez un continent [%1]:

source: Please choose a country [%1]:
fr: Choisissez un pays [%1]:

source: Please choose a different location:
fr: Choisissez une localité diférrente:

source: Please choose a host [%1]:
fr: Choisissez un nom de machine [%1]:

source: Please choose an option
fr: Choisissez une option

source: Please choose an option [%1]:
fr: Choisissez une option [%1]:

source: Please follow the instruction in README to install nmake first.
fr: Suivez les instructions du README pour installer nmake d'abord.

source: Please follow the instruction in README to install nmake manually.
fr: Suivez les instruction du README pour installer nmake d'abord

source: Please pick one [1]:
fr: Choisissez en un [1]:

source: Please tell me where I can find it:
fr: Dites-moi où je peux trouver:

source: Prereqs are found, but not allowed to install! Returning list of prereqs
fr: Prérequis trouvés, mais non autorisé à les installer! Je retrourne la liste desprérequis.

source: Problem downloading one or more files
fr: Problême lors du téléchargement de l'un ou plusieurs fichiers

source: Problem uninstalling one or more modules
fr: Problêmes rencontrés lors de la déinstallation de un ou plusieurs modules

source: RPM of %1 could not be installed: %2
fr: RPM de %1 ne peut être installé: %2

source: RPM of %1 failed with : %2
fr: RPM de %1 échoué avec : %2

source: ReadLine support
fr: Support de ReadLine

source: ReadLine support %1.
fr: Support de ReadLine %1.

source: Recursive dependency detected in %1, skipping
fr: Dépendance récursive détectée sur %1, on passe

source: Report %1's testing result (%2)? [y/N]:
fr: Reporter le résultat du test de %1 (%2)? [y/N]:

source: Report %1's testing result (%2)?:
fr: Envoyer le rapport de test pour %1 (%2) ?

source: Report tests results?
fr: Envoyer les rapports de tests ?

source: Required executable 'nmake' not found. Install it?
fr: Executable nécessaire 'nmake' non trouvé. L'installer ?

source: Required option '%1' is not provided for %2
fr: Option nécessaire pour '%1' non fournie pour %2

source: Required option '%1' is not provided for %2 by %3
fr: L'option obligatoire '%1' n'a pas été fourni par %3 pour %2

source: Retrieving %1
fr: Lecture de %1

source: Running [%1]...
fr: Lancement [%1]...

source: Selected %1
fr: %1 sélectionné

source: Sending report for %1
fr: Envoi du rapport pour %1

source: Should I be verbose?
fr: Est-ce que je dois être bavard?

source: Should I use it? [Y/n]:
fr: Est-ce que je peux l'utiliser? [Y/n]:

source: Signature checking failed for %1
fr: Vérification de la signature échoué pour %1

source: Skipping setup; advanced tests will be disabled.
fr: On saute le setup; les tests avancés sont désactivés.

source: Some prerequisites failed - skip sending test reports.
fr: Certains prérequis échoués - envoi du rapport de test sauté

source: Stack printed successfully
fr: Pile affichée avec succès

source: Standard, supplied with Perl 5
fr: Standart, fourni avec Perl 5

source: Standard-Perl: user may choose between GPL and Artistic
fr: Perl Standart: les utilisateurs doivent choisir entre la GPL et l'Artistic

source: Successfully fetched %1
fr: Récupération avec succès de %1

source: Successfully sent report for %1.
fr: Envoi du rapport pour %1 avec succès.

source: Switching to the default shell %1
fr: Retour au shell par défault %1

source: Terminal size support
fr: Support taille du terminal

source: Testing
fr: Test

source: Testing %2 failed!
fr: Test de %2 echoué!

source: Testing: %1\n
fr: Test de: %1\n

source: The error I got was %1
fr: L'erreur que j'ai récupéré était %1

source: The modules in the CPAN archives are protected with md5 checksums.
fr: Les modules du CPAN sont protégés par des checksums MD5.

source: The object you passed has the wrong ref type: '%1'
fr: L'objet passé n'est pas une référence du bon type: '%1'
